Repository: ayanadamtew/cityfix-mobile
Catalog: lib/l10n/app_*.arb
Languages: am

# appTitle
source: CityFix Jimma
am: ሲቲፊክስ ጅማ

# appSubtitle
source: Jimma City Civic Reporting
am: የጅማ ከተማ የዜጎች ጉዳይ ሪፖርት

source: Login
am: ግባ

source: Email
am: ኢሜይል

source: Password
am: የይለፍ ቃል

# emailRequired
source: Email is required
am: ኢሜይል ያስፈልጋል

# emailInvalid
source: Enter a valid email
am: ትክክለኛ ኢሜይል ያስገቡ

# passwordRequired
source: Password must be at least 6 characters
am: የይለፍ ቃል ቢያንስ 6 ቁምፊዎች መሆን አለበት

# noAccount
source: Don't have an account? Register
am: መለያ የለዎትም? ይመዝገቡ

source: Create Account
am: መለያ ይፍጠሩ

source: Full Name
am: ሙሉ ስም

# fullNameHint
source: Abebe Bekele
am: ተስፋዬ ለማ

# fullNameRequired
source: Name is required
am: ስም ያስፈልጋል

# alreadyHaveAccount
source: Already have an account? Login
am: መለያ አለዎት? ግባ

source: Profile
am: መገለጫ

source: Verified Citizen
am: የተረጋገጠ ዜጋ

source: Unverified
am: ያልተረጋገጠ

source: Your Impact
am: የእርስዎ አስተዋጽኦ

source: Total Reports
am: ጠቅላላ ሪፖርቶች

source: Resolved
am: የተፈቱ

# settingsTitle
source: Settings & Preferences
am: ቅንብሮች እና ምርጫዎች

source: Push Notifications
am: የግፊት ማሳወቂያዎች

# pushEnabled
source: Push Notifications Enabled.
am: የግፊት ማሳወቂያዎች ነቅተዋል።

# pushDisabled
source: Push Notifications Disabled.
am: የግፊት ማሳወቂያዎች ጠፍተዋል።

source: App Theme
am: የመተግበሪያ ገጽታ

source: System Default
am: የስርዓት ነባሪ

source: Light Mode
am: ብርሃን ሁነታ

source: Dark Mode
am: ጨለማ ሁነታ

source: Language
am: ቋንቋ

source: Privacy Policy
am: የግለኝነት ፖሊሲ

source: Help & Support
am: እርዳታ እና ድጋፍ

# helpContent
source: If you need assistance using the CityFix app, please contact the Jimma City municipal office at support@cityfix.com or call 911 for emergencies.
am: የሲቲፊክስ መተግበሪያን ለመጠቀም እርዳታ ከፈለጉ፣ support@cityfix.com ወይም ለድንገተኛ ሁኔታዎች 911 ይደውሉ።

source: Close
am: ዝጋ

source: Sign Out
am: ውጣ

# privacyIntro
source: Welcome to CityFix, an urban civic issue reporting and management system designed for the Jimma City Administration. Our platform aims to enhance communication between citizens and municipal authorities to improve urban service delivery. This Privacy Policy explains how we collect, use, protect, and share your information when you use the CityFix mobile application and web platform. Effective Date: February 27, 2026
am: የግላዊነት ፖሊሲ (Privacy Policy) Welcome to CityFix, an urban civic issue reporting... (English follows for detail) Effective Date: February 27, 2026

# privacyDataCollection
source: 2. Information We Collect To provide and improve our services, we collect the following types of information: • Account Information: full name, email, phone, address, and profile image. • Authentication Data: securely hashed passwords. • Issue Report Data: description, category, and Kebele. • Media and Location Data: optional photos and exact GPS coordinates. • Engagement Data: urgency votes, feedback comments, and reporting history.
am: 2. Information We Collect... (See English version for details)

# privacyDataSecurity
source: 3. How We Use Your Information We use your data to: • Provide Services: register/log you in via Firebase. • Route and Resolve Issues: send reports to appropriate municipal sectors. • Communicate with You: send real-time notifications. • Analyze and Plan: generate analytical reports for city planners.
am: 3. How We Use Your Information... (See English version for details)

# privacyNotifications
source: 4. Data Sharing and Disclosure Your data is shared strictly for operational purposes: • Municipal Authorities: reports, photos, and GPS locations are visible to Kebele-level officials and Sector Administrators. • System Administrators: Super Administrators oversee system operations. 5. Data Security We protect your data via: • Secure Storage: cloud-based databases (MongoDB/Firebase). • Encryption: HTTPS protocols for all communications. • Access Control: role-based access enforce strict permissions. 6. Your Rights and Choices • Profile Management: update your info anytime. • Notifications: toggle alerts in settings. • Tracking: view your history and track status without admin interference. 7. Contact Us If you have any questions or concerns about this Privacy Policy or how your data is handled, please contact the Jimma City Administration or visit your local Kebele office.
am: 4. Data Sharing and Disclosure... (See English version for details)

# feedNear
source: Near
am: ቅርብ

# feedNew
source: New
am: አዲስ

# feedUrgent
source: Urgent
am: አስቸኳይ

# feedEverywhere
source: Everywhere
am: በሁሉም ቦታ

# feedSearchHint
source: Search issues...
am: ጉዳዮችን ፈልግ...

# feedNoIssues
source: No issues reported yet.
am: እስካሁን ምንም ጉዳይ አልተዘገበም።

# feedBeFirst
source: Be the first to report a problem!
am: ችግር ለመዘገብ ቀዳሚ ይሁኑ!

# feedLoadError
source: Unable to load feed
am: ዜናን መጫን አልተቻለም

source: Notifications
am: ማሳወቂያዎች

source: Clear All
am: ሁሉንም አጽዳ

# noNotifications
source: You're all caught up!
am: ሁሉም ጠርቷል!

# upvoted
source: Upvoted ({score})
am: ድምጽ ሰጥቷል ({score})

# upvote
source: Upvote ({score})
am: ድምጽ ስጥ ({score})

source: Report an Issue
am: ጉዳይ ሪፖርት አድርግ

source: Category
am: ምድብ

# kebele
source: Kebele (Neighborhood)
am: ቀበሌ (አካባቢ)

source: Description
am: መግለጫ

source: Detailed Description
am: ዝርዝር መግለጫ

# descriptionHint
source: Describe the issue...
am: ጉዳዩን ይግለጹ...

# tapToPhoto
source: Tap to take a photo
am: ፎቶ ለማንሳት ነካ ያድርጉ

source: Location
am: ቦታ

# detectLocation
source: Detect Current Location
am: ወቅታዊ ቦታን ፈልግ

# locationInstruction
source: Tap the map to set a location, or press detect.
am: ቦታ ለማቀናበር ካርታ ላይ ነካ ያድርጉ፣ ወይም ፈልግ ይጫኑ።

source: Location pinpointed
am: ቦታ ተቀምጧል

# locationSelected
source: Selected: {address}
am: የተመረጠ: {address}

# locationError
source: Location error: {error}
am: የቦታ ስህተት: {error}

# locationRequired
source: Please detect your location or tap on the map
am: ቦታዎን ፈልጉ ወይም ካርታ ላይ ነካ ያድርጉ

source: Submit Report
am: ሪፖርት ላክ

# reportSaved
source: Saved to Offline Drafts. Will sync automatically.
am: ኦፍላይን ረቂቆች ውስጥ ተቀምጧል። ራሱ ሲሳካ ተመሳስሏል።

# reportSuccess
source: Issue reported successfully!
am: ጉዳዩ በተሳካ ሁኔታ ተዘግቧል!

# failedToSubmit
source: Failed to submit: {error}
am: መላክ አልተሳካም: {error}

source: Fetching address...
am: አድራሻ እየፈለጉ...

source: Required
am: ያስፈልጋል

source: My Reports
am: ሪፖርቶቼ

# noReportsYet
source: You haven't reported anything yet.
am: እስካሁን ምንም አልዘገቡም።

source: Edit Report
am: ሪፖርት አስተካክል

source: Save Changes
am: ለውጦችን አስቀምጥ

source: Update Map Location
am: የካርታ ቦታን አዘምን

# rateResolution
source: Rate the Resolution
am: መፍትሄውን ዋጋ ስጥ

source: Optional comment...
am: ተጨማሪ አስተያየት (አስፈላጊ ካልሆነ ይዘለሉ)...

source: Submit Feedback
am: አስተያየት ላክ

source: Feedback Submitted!
am: አስተያየቱ ተልኳል!

# failedGeneric
source: Failed: {error}
am: አልተሳካም: {error}

# reportUpdated
source: Report Updated Successfully
am: ሪፖርቱ በተሳካ ሁኔታ ተዘምኗል

# updateFailed
source: Update failed: {error}
am: ዝማኔ አልተሳካም: {error}

# reportIssueMenu
source: Report Issue
am: ጉዳዩን ሪፖርት አድርግ

# reportDialogTitle
source: Report Issue
am: ጉዳዩን ሪፖርት አድርግ

# reportDialogReason
source: Reason
am: ምክንያት

# reportDialogHint
source: Why is this issue unnecessary or inappropriate?
am: ይህ ጉዳይ ለምን አግባብ አይደለም?

source: Cancel
am: ሰርዝ

source: Submit
am: ላክ

# reportedForReview
source: Issue reported for review successfully.
am: ጉዳዩ ለግምገማ ተዘግቧል።

# failedToReport
source: Failed to report issue.
am: ጉዳዩን ሪፖርት ማድረግ አልተሳካም።

source: Anonymous Citizen
am: ስም-አልባ ዜጋ

source: Not logged in.
am: አልገቡም።

# navFeed
source: Feed
am: ዜና

# navSearch
source: Search
am: ፈልግ

# navMyReports
source: My Reports
am: ሪፖርቶቼ

# navProfile
source: Profile
am: መገለጫ

# catWater
source: Water
am: ውሃ

# catWaste
source: Waste
am: ቆሻሻ

# catRoad
source: Road
am: መንገድ

# catElectricity
source: Electricity
am: መብራት

# catOther
source: Other
am: ሌላ

# statusPending
source: Pending
am: በመጠባበቅ ላይ

# statusInProgress
source: In Progress
am: በሂደት ላይ

# statusResolved
source: Resolved
am: ተፈቷል

source: Report Detail
am: የሪፖርት ዝርዝር

source: Community Discussion
am: የማህበረሰብ ውይይት

# commentsCount
source: {count} comments
am: {count} አስተያየቶች

# noCommentsYet
source: No comments yet. Start the conversation!
am: እስካሁን ምንም አስተያየት የለም። ውይይቱን ይጀምሩ!

# commentHint
source: Add a helpful comment...
am: ጠቃሚ አስተያየት ያክሉ...

source: Report Location
am: የሪፖርት ቦታ

# offlineMode
source: Offline Mode - Viewing Cached Data
am: ኦፍላይን ሁነታ - የተቀመጠ ውሂብ በማሳየት ላይ

# youAreOffline
source: You are offline. Interactions are disabled.
am: ኦፍላይን ነዎት። ተግባራት ተሰናክለዋል።

# backOnline
source: Back online. Connectivity restored!
am: ተመልሰዋል! ኢንተርኔት ተያይዟል።

source: Edit Profile
am: ፕሮፋይል ያርሙ

# profileUpdated
source: Profile updated successfully!
am: ፕሮፋይሉ በተሳካ ሁኔታ ተሻሽሏል!

# profileUpdateFailed
source: Failed to update profile
am: ፕሮፋይሉን ማሻሻል አልተቻለም

# enterName
source: Please enter your name
am: እባክዎን ስምዎን ያስገቡ

source: Retry
am: እንደገና ይሞክሩ

# commentFailed
source: Failed to post comment: {error}
am: አስተያየት መለጠፍ አልተሳካም: {error}

# loginFailed
source: Login failed: {error}
am: መግባት አልተሳካም: {error}

# registrationFailed
source: Registration failed: {error}
am: ምዝገባ አልተሳካም: {error}

# errorInvalidCredentials
source: Invalid email or password. Please try again.
am: የተሳሳተ ኢሜይል ወይም የይለፍ ቃል:: እባክዎ እንደገና ይሞክሩ::

# errorNetwork
source: Network error. Please check your connection.
am: የኔትወርክ ችግር:: እባክዎን ግንኙነትዎን ያረጋግጡ::

# errorTooManyRequests
source: Too many attempts. Please try again later.
am: ብዙ ሙከራዎች ተደርገዋል:: እባክዎ ቆይተው እንደገና ይሞክሩ::

# errorUnknown
source: An unexpected error occurred. Please try again.
am: ያልተጠበቀ ስህተት ተከስቷል:: እባክዎ እንደገና ይሞክሩ::

# errorEmailInUse
source: This email is already in use by another account.
am: ይህ ኢሜይል ቀደም ብሎ በሌላ መለያ ጥቅም ላይ ውሏል::

source: Phone Number
am: ስልክ ቁጥር

# phoneRequired
source: Phone number is required
am: ስልክ ቁጥር ያስፈልጋል

# phoneInvalid
source: Enter a valid phone number (e.g. +251...)
am: ትክክለኛ ስልክ ቁጥር ያስገቡ (ለምሳሌ +251...)

# loginWithPhone
source: Phone
am: ስልክ

# loginWithEmail
source: Email
am: ኢሜይል

# registerWithPhone
source: Phone
am: ስልክ

# registerWithEmail
source: Email
am: ኢሜይል

source: Send OTP
am: OTP ላክ

# otpSent
source: OTP sent to {phone}
am: OTP ወደ {phone} ተልኳል

source: Enter OTP
am: OTP ያስገቡ

# otpHint
source: 6-digit code
am: 6-አሃዝ ኮድ

# otpRequired
source: Please enter the OTP
am: OTP ያስፈልጋል

source: Verify
am: አረጋግጥ

# otpVerificationTitle
source: Verify Your Number
am: ቁጥርዎን ያረጋግጡ

# otpVerificationSubtitle
source: Enter the 6-digit code sent to {phone}
am: ወደ {phone} የተላከውን 6-አሃዝ ኮድ ያስገቡ

source: Resend OTP
am: OTP እንደገና ላክ

# errorInvalidOtp
source: Invalid OTP. Please try again.
am: የተሳሳተ OTP። እባክዎ እንደገና ይሞክሩ

# errorOtpExpired
source: OTP expired. Please request a new one.
am: OTP ጊዜ አልፏል። አዲስ ይጠይቁ

# errorPhoneInUse
source: This phone number is already linked to another account.
am: ይህ ስልክ ቁጥር ቀደም ብሎ ለሌላ መለያ ጥቅም ላይ ውሏል

# continueText
source: Continue
am: ቀጥል
